[
    {
        "image": "booki.webp",
        "title": "Booki",
        "text": "Conception d'un site en HTML et CSS depuis une maquette Figma. Utilisation de Flexbox, mise en place de la partie responsive, validation W3C.",
        "link": "https://github.com/Johanne81/Booki", 
        "alt": "Image de couverture du site Booki"
    },
    {
        "image": "Sophie-Bluel.webp",
        "title": "Sophie Bluel",
        "text": "Création d'une page dynamique avec Javascript pour le portfolio d'une architecte d'intérieur. Affichage des projets, gestion de la connexion utilisateur et création d'une modale dynamique d'ajout de projet.",
        "link": "https://github.com/Johanne81/sophie-bluel.git",
        "alt": "Image de couverture du site de Sophie Bluel"
    },
    {
        "image": "kasa.webp",
        "title": "Kasa",
        "text": "Refonte d'une application web de location immobilière avec React. Mise en place du routeur, ajout de collapses, d'un carousel, appels API, animations css.",
        "link": "https://github.com/Johanne81/Kasa.git",
        "alt": "Image de couverture du site Kasa"
    },
    {
        "image": "EcoBlissBath.webp",
        "title": "EcoBlissBath",
        "text": "Rédaction et mise en place de scripts d'automatisation en JavaScript via Cypress sur les fonctionnalités critiques du site. Rédaction d'un rapport de tests détaillé.",
        "link": "https://github.com/Johanne81/Eco_Bliss.git",
        "alt": "Image de couverture du site EcoBlissBath"
    },
    {
        "image": "Menu-Maker.webp",
        "title": "Menu Maker by Qwenta",
        "text": "Planification et gestion du développement d'un site web : veille technologique, rédaction des spécifications techniques à partir des besoins fonctionnels, tableau Kanban sur Notion, présentation orale expliquant mes choix.",
        "link": "https://drive.google.com/drive/folders/1zrv6ZaqqS92ckDq0q8tjG5BptOG82y5_",
        "alt": "Image de couverture du site Menu Maker by Qwenta",
        "aria-label": "Accéder au dossier Gestion de projet"
    },
    {
        "image": "tomsen.webp",
        "title": "Tomsen",
        "text": "Conception d'une stratégie de test : analyse des spécifications fonctionnelles et de la maquette, rédaction de la revue des exigences, élaboration de la stratégie de test et du cahier de recettes détaillé.",
        "link": "https://drive.google.com/drive/folders/1iV2wY8LZp-RTKMfK50H0-sYX1Z60Dx_i",
        "alt": "Image de couverture du site Tomsen",
        "aria-label": "Accéder au dossier Stratégie de test"
    }
]
